import 'package:flutter/material.dart';
import 'icons.dart';
import 'images.dart';

List filmSlider = [
  {
    "hight": .2,
    'id': 1,
    'title': "AVATAR",
    "img": iAvatar,
    'discrip':
        "يحكي هذا الفيلم قصة جندي أمريكي مقعد يتم إرساله إلى قمر بعيد في الفضاء يسمى «باندورا»، الكوكب الذي تسكنه كائنات مسالمة زرقاء اللون تسمى «نأفيي» يبلغ طولهأ حوالي 3 أمتار. كانت تعيش بأمن واستقرار قبل وصول البشر الذين جاؤوا للتنقيب عن معدن ثمين جدا في هذا الكويكب",
  },
  {
    "hight": .13,
    'id': 2,
    'title': "Plane",
    "img": iPlane,
    'discrip':
        'طيار مدني يجد نفسه عالقًا في -منطقة حرب- بعد أن أجبرته الظروف الجويّة الصعبة على الهبوط بطائرته في تلك المنطقة المضطربة',
  },
  {
    "hight": .2,
    'id': 3,
    'title': 'ANT-MAN',
    "img": iAntAmn,
    'discrip':
        'يستكشف سكوت لانج (انتمان) وهوب فان دين (واسب) و Hope Van Dyne ، جنبًا إلى جنب مع دكتور هانك بيم و جانيت فان دين (واسب) عالم الكم ، حيث يتفاعلون مع مخلوقات غريبة ويشرعون في مغامرة تتجاوز حدود أبعد ما يعتقدوا أنه ممكن.',
  },
];

List categoryList = [
  {
    'id': 1,
    'title': "Action",
    'icon': iAction,
    "mList": mAction,
    'sList': sAction,
  },
  {
    'id': 2,
    'title': "Drama",
    'icon': iDrama,
    "mList": mDrama,
    'sList': sDrama,
  },
  {
    'id': 3,
    'title': "Romantic",
    'icon': iRomantic,
    "mList": mRomantic,
    'sList': sRomantic,
  },
  {
    'id': 4,
    'title': "Comedy",
    'icon': iComedy,
    "mList": mComedy,
    'sList': sComedy,
  },
  {
    'id': 5,
    'title': "Crime",
    'icon': iCrime,
    "mList": mCrime,
    'sList': sCrime,
  },
  {
    'id': 6,
    'title': "Kids",
    'icon': iKids,
    "mList": mKids,
    'sList': sKids,
  },
  {
    'id': 7,
    'title': "Adventure",
    'icon': iAdventure,
    "mList": mAdventure,
    'sList': sAdventure,
  },
  {
    'id': 8,
    'title': "Fantasy",
    'icon': iFantasy,
    "mList": mFantasy,
    'sList': sFantasy,
  },
  {
    'id': 9,
    'title': "Horror",
    'icon': iHorror,
    "mList": mHorror,
    'sList': sHorror,
  },
  {
    'id': 10,
    'title': "Pinoy",
    'icon': iPinoy,
    "mList": mPinoy,
    'sList': sPinoy,
  },
  {
    'id': 11,
    'title': "Trukish",
    'icon': iTrukish,
    "mList": mTrukish,
    'sList': sTrukish,
  },
];
List mAction = [
  {
    "hight": .19,
    'discrip':
        'تدور أحداث الفيلم حول مجموعة من المساجين الأكثر شرًا على الأرض ويعرفهم الجميع باسم (الفرقة الانتحارية)، والذين ينجحون في عقد اتفاق مع وكالة حكومية فاسدة من أجل تنفيذ مهام شديدة',
    "title": "The Suicide Squad",
    "year": '2021',
    "rate": '7.2/10',
    'img': am1,
  },
  {
    "hight": .19,
    'discrip':
        'يصل" شيكيرو" الي مدينه "يلو ستون" للبحث عن كيفيه العودة الي وطنه الاساسي و لكن في نفس اليوم من وصوله يكتشف سكان البلدة ان المدينه تحتوي علي ذهب و الذي اكتشف مكان الذهب يتم قتله وفتذهب الشكوك الي " شيكيرو" و يتم وضعه في الحبس بتهمة القتل .',
    "title": "Murder at Yellowstone City",
    "year": '2022',
    "rate": '5.2/10',
    'img': am2,
  },
];
List sAction = [
  {
    "hight": .24,
    'discrip':
        'تقع أحداث السلسلة في قارّتين خياليتين هما ويستروس وإيسوس في نهاية صيف طويل جداً أمتدّ لعقد قبل بداية أحداثِ الجُزء الأوّل، وقد وُحّدت الممالك السَبع في قارّة ويستروس تحت راية آل تاغاريان. تبدأ أحداث الرواية الأوّلى صراع العروش بعدَ 15 عاماً من مقتل آخر حُكّام آل تاغاريان ونفي ذُرّيته إلى القارة إيسوس، وتنصيب روبرت براثيون حاكِماً للممالك  السَبع',
    "title": "GAME OF THRONES",
    "year": '2019',
    "rate": '18+',
    'img': sa1,
  },
  {
    "hight": .19,
    'discrip':
        'تدور أحداث المسلسل حول وحدة استخباراتية سرية تابعة للجيش البريطاني (القسم 20) ، والذي يضم مجموعة من أفراد العمليات الخاصة ، الذين يقومون بعمليات بالغة الخطورة ، منها ملاحقة عضو تنظيم القاعدة',
    "title": "Strike Back",
    "year": '2020',
    "rate": '18+',
    'img': sa2,
  },
];
List mDrama = [
  {
    "hight": .17,
    'discrip':
        'في قرية صيد تعصف بها الرياح ، تشعر الأم بالحيرة بين حماية ابنها الحبيب وإحساسها بالصواب والخطأ. الكذبة التي ترويها له تمزق أسرهم ومجتمعهم المتماسك في هذه الملحمة العاطفية المتوترة.',
    "title": "God's Creatures",
    "year": '2022',
    "rate": '6.1/10',
    'img': md1,
  },
  {
    "hight": .15,
    'discrip':
        'يحاول مدرس اللغة الإنجليزية المنعزل والسمنة المفرطة إعادة الاتصال بابنته المراهقة المنعزلة. هل سيتمكن من الوصول إليها',
    "title": "The Whale",
    "year": '2022',
    "rate": '7.8/10',
    'img': md2,
  },
];
List sDrama = [
  {
    "hight": .2,
    'discrip':
        'تقع أحداث المسلسل في «وست وورلد»، وهو منتزه خيالي متقدم تقنيًا تعيش فيه روبوتات اصطناعية شبيهة جدا بالبشر، وتدعى «المضيفون»، والغرض من وجودها تلبية رغبات الزوار الأثرياء الذين يطلق عليها اسم «الوافدون الجدد». يستطيع الوافدون الجدد فعل ما يريدون داخل المنتزه دون الخوف من انتقام المضيفين',
    "title": "WESTWORLD",
    "year": '2022',
    "rate": '18+',
    'img': sd1,
  },
  {
    "hight": .14,
    'discrip':
        'في عام 1990 ، يعمل محامٍ مساعد وخبير من مكتب التحقيقات الفيدرالي معًا لحل قضية من مركز بوسطن للعدالة.',
    "title": "My Brilliant Friend",
    "year": '2022',
    "rate": '18+',
    'img': sd2,
  },
];
List mRomantic = [
  {
    "hight": .21,
    'discrip':
        'تدور أحداث الفيلم عام 1927؛ حيث الممثل جورج فالتين (جان دوجاردان) الذي يؤدي أدوارًا بالأفلام الصامتة محققا أعلى الإيرادات بأفلامه ،حتى أصبح نجما لشباك التذاكر يتهافت عليه المخرجون والمنتجون لتقديم أعمال فنية ناجحة، فيتعرف جورج على الفتاة بيبي ميلر (برنيس بيجو) التي تستغل صورتها معه في إحدى الحفلات',
    "title": "The Artist",
    "year": '2011',
    "rate": '7.9/10',
    'img': mr1,
  },
  {
    "hight": .19,
    'discrip':
        'في خلال فترة الإغلاق والحظر بسبب تفشي فيروس كوفيد-19، يضطر زوجين للبقاء معًا بالمنزل، حيث تبدأ مرحلة فارقة في علاقتهما تضعهما وتضع زواجهما تحت التقييم',
    "title": "Together ",
    "year": '2021',
    "rate": '6.2/10',
    'img': mr2,
  },
];
List sRomantic = [
  {
    "hight": .2,
    'discrip':
        'تدور أحداث مسلسل التفاحة الممنوعة في مدينة إسطنبول ويجسد المسلسل قصة اندر التي تكون متزوجة من رجل أعمال غني ولكنه بخيل، فتجد الحل لتحضر له يلديز الفتاة الجميلة، وهي طموحة وتحلم دائما بالزواج برجل غني لتعيش معه حياة الرفاهية',
    "title": "Al Tufah Al Haram",
    "year": '2021',
    "rate": 'PG15',
    'img': sr1,
  },
  {
    "hight": .19,
    'discrip':
        ' ريهام ، الفتاة الصغيرة التي تطمح في أن تصبح كاتبة ، يجبرها والداها على الاختيار بين زواج مرتب وإيجاد وظيفة مناسبة. تسرع في الحصول على وظيفة جديدة في شركة إعلانات ، وسرعان ما تقع في الحب',
    "title": "Ta'er Al Sabah ",
    "year": '2020',
    "rate": '18+',
    'img': sr2,
  },
];
List mComedy = [
  {
    "hight": .16,
    'discrip':
        'بعد شتاء قاسٍ بشكل خاص ، دخل براين في اكتئاب عميق منعزلاً تمامًا ولا يوجد من يتحدث إلى براين يفعل ما سيفعله أي شخص عاقل عندما يواجه مثل هذا الموقف الكئيب',
    "title": "Brian and Charles ",
    "year": '2022',
    "rate": '8.4/10',
    'img': mc1,
  },
  {
    "hight": .15,
    'discrip':
        'تعاون زوجان مطلقان ويسافران إلى بالي لمنع ابنتهما من ارتكاب نفس الخطأ الذي يعتقدون أنهما ارتكبهما قبل 25 عامً',
    "title": "Ticket to Paradise",
    "year": '2022',
    "rate": '6.7/10',
    'img': mc2,
  },
];
List sComedy = [
  {
    "hight": .16,
    'discrip':
        'هو مسلسل كوميدي يصور دقائق الحياة اليومية وخاصة تلك التي تتعلق بمشاكل وأخطاء لاري ديفيد، وتصرفات الناس المزعجين من حوله، وتفاعله معهم.',
    "title": "Curb Your Enthusiasm",
    "year": '2021',
    "rate": '18+',
    'img': sc1,
  },
  {
    "hight": .16,
    'discrip':
        'مسلسل أمريكي وثائقي كوميدي،في المسلسل يُحاول ناثان مساعدة أصحاب الأعمال والناس بطرق غير اعتيادية عبر خدماته التسويقية واستشاراته الإدارية',
    "title": " At The Comedy Cellar",
    "year": '2020',
    "rate": 'PG15',
    'img': sc2,
  },
];
List mCrime = [
  {
    "hight": .16,
    'discrip':
        'بسبب حظها ومثقلة بالديون ، تتورط إميلي في عملية احتيال على بطاقة الائتمان تسحبها إلى عالم الجريمة الإجرامي في لوس أنجلوس ، مما يؤدي في النهاية إلى عواقب مميتة..',
    "title": "Emily the Criminal",
    "year": '2022',
    "rate": '6.8/10',
    'img': mcr1,
  },
  {
    "hight": .14,
    'discrip':
        'امرأة شابة أصيبت بصدمة بسبب حدث مأساوي في ماضيها ، وتسعى للانتقام من أولئك الذين عبروا طريقها',
    "title": "Promising Young Woman ",
    "year": '2020',
    "rate": '7.5/10',
    'img': mcr2,
  },
];
List sCrime = [
  {
    "hight": .18,
    'discrip':
        'تقع هذه السلسلة فى بوسطن، وفي تسعينيات القرن الماضي يعمل محامٍ مساعد ومساعد مخضرم فاسد في مكتب التحقيقات الفيدرالي فى بوسطن، حيث قاموا معًا بالنظر في قضية تشمل نظام العدالة الجنائية في بوسطن وتهدف الى تخريبه',
    "title": "CITY ON A HILL",
    "year": '2022',
    "rate": '18+',
    'img': scr1,
  },
  {
    "hight": .16,
    'discrip':
        'جريمة منظمة يعود إليوت ستابلر إلى قسم شرطة نيويورك لمواجهة أقوى عصابات الجريمة المنظمة في المدينة وإعادة بناء حياته في أعقاب العديد من الخسائر في حياته الشخصية',
    "title": "Law and order",
    "year": '2022',
    "rate": 'PG15',
    'img': scr2,
  },
];
List mKids = [
  {
    "hight": .14,
    'discrip':
        'يتطلع كلب لاكتشاف هدفه في الحياة على مدار حياة ومالكين متعددين شاهد فيلم المغامرة المذهل مع إيثان وكلبه!',
    "title": "A Dog's Purpose",
    "year": '2017',
    "rate": '7.2/10',
    'img': mk1,
  },
  {
    "hight": .16,
    'discrip':
        'تنضم حيوانات مدغشقر إلى سيرك أوروبي يكافح من أجل العودة إلى نيويورك ، لكن تجد نفسها تلاحق من قبل ضابط نفساني في مراقبة الحيوانات',
    "title": "Madagascar ",
    "year": '2012',
    "rate": '6.8/10',
    'img': mk2,
  },
];
List sKids = [
  {
    "hight": .18,
    'discrip':
        'هو برنامج رسوم متحركة أمريكي كندي من إنتاج الشركة الأمريكية الشهيرة للرسوم المتحركة نكلوديون  هم طفل وسبعة كلاب صغيرة يحبون وضع حلول للمشاكل وإنقاذ الناس من مشاكلهم وإنقاذ سكان مدينتهم من الأخطار',
    "title": "Paw Patrol",
    "year": '2020',
    "rate": 'FAMILY',
    'img': sk1,
  },
  {
    "hight": .18,
    'discrip':
        'مسلسل رسوم متحركة أمريكي من إنتاج استوديوهات نكلوديون للرسوم المتحركة  يتحدث المسلسل عن لينكولن لاود وأفراد عائلة لاود التي تقضي أوقات رائعة مع بعضهم البعض والاستمتاع بها على طريقتهم الخاص',
    "title": "The Loud House",
    "year": '2020',
    "rate": 'FAMILY',
    'img': sk2,
  },
];
List mAdventure = [
  {
    "hight": .18,
    'discrip':
        ' ملحمي خيال علمي إثارة من إخراج جيمس جراي وتأليف جيمس وإيثان جروس. الفيلم من بطولة براد بيت ،تومي لي جونز،روث نيجا ،دونالد سثرلاند ،جيمي كينيدي. ويحكي عن رائد فضاء يذهب إلى الفضاء بحثاً عن والده المفقود، الذي تهدد تجربته النظام الشمسي',
    "title": "Ad Astra",
    "year": '2019',
    "rate": '6.5/10',
    'img': mad1,
  },
  {
    "hight": .16,
    'discrip':
        'مورتال كومبات تدور أحداث الفيلم في قالب من التشويق واﻹثارة حول بطل شاب يتورط في معركة طاحنة متعددة الأبعاد؛ فيبدأ في إدراك إمكانياته الحقيقية من خلال خوضه هذه التجربة',
    "title": "Mortal Kombat",
    "year": '2021',
    "rate": '6.1/10',
    'img': mad2,
  },
];
List sAdventure = [
  {
    "hight": .16,
    'discrip':
        'فتيات في مهمة تدور أحداث العمل حول أفضل خمسة صديقات من عصبة ألعاب الليجو واللاتي تحاولن معًا فعل الشيء الصحيح في المدينة، ومعرفة الصداقات وما هو مهم على طول الطريق.',
    "title": "Lego Friends",
    "year": '2020',
    "rate": 'PG',
    'img': sad1,
  },
  {
    "hight": .18,
    'discrip':
        'قصة المسلسل تقع على جزيرة بروفيدانس الجديدة خلال العصر الذهبي للقراصنة وتتبع مغامرات القبطان القبطان فلينت وقراصنته. العديد من القراصنة الحقيقين تم تجسيدهم في المسلسل أمثال آن بوني وجاك راكهام وتشارلز فاين واللحية السوداء. ',
    "title": "Black Sails",
    "year": '2017',
    "rate": '18+',
    'img': sad2,
  },
];
List mFantasy = [
  {
    "hight": .16,
    'discrip':
        'على متن كوكب غامض غير معروف، وبعد تمزق كوكب اﻷرض بسبب الصراعات الدينية المميتة، تقوم مجموعة من الآلات بمهمة محددة وهي تربية أطفال البشر في مواجهة مصير مجهول',
    "title": "Raised By Wolves",
    "year": '2022',
    "rate": '7.5/10 ',
    'img': mf1,
  },
  {
    "hight": .16,
    'discrip':
        'يسعى باري آلين لاستغلال قدراته من أجل تغيير ماضيه وإنقاذ والدته من الموت، ولكن تتسبب محاولاته في خلل بالزمن والعوالم الموازية، ويصارع من أجل إنقاذ المستقبل.',
    "title": "The flash ",
    "year": '2023',
    "rate": '7.5/10',
    'img': mf2,
  },
];
List sFantasy = [
  {
    "hight": .18,
    'discrip':
        'بعد سقوطها عبر بوابة سحرية في عام 1905 ، والسفر عبر الزمن إلى المستقبل ، كانت لينا جريسكي ، أميرة روسية وطالبة في مدرسة أوبرا باريس للباليه المشهورة عالميًا ، تبذل قصارى جهدها للاندماج في الوقت الذي تكتشف فيه الفترة الزمنية الموجودة فيها',
    "title": "Find Me In Paris",
    "year": '2020',
    "rate": 'PG',
    'img': sf1,
  },
  {
    "hight": .2,
    'discrip':
        'هو مسلسل دراما من إنشاء وإنتاج آلان بول، مستوحى من سلسلة كتب ألغاز ماصي دماء الجنوب (The Southern Vampire Mysteries)  أحداثه تقع في عالم يعيش فيه مصاصي الدماء في العلن، ويتبع حياة نادلة تخاطرية تدعى «سوكي ستاكهاوس» في بلدة خيالية بولاية لويزيانا.',
    "title": "True Blood",
    "year": '2014',
    "rate": '18+',
    'img': sf2,
  },
];
List mHorror = [
  {
    "hight": .2,
    'discrip':
        'تدور الأحداث في إطار من الرعب حول مجموعة من الأشخاص تربطهم ظواهر غامضة. يتخبط (أو جاي هايوود) وشقيقته (إيميرالد) أثناء محاولتهما للحفاظ على تراثهما العائلي الخاص بتربية الخيول، بينما تقع أحداث غريبة في المقاطعة الصحراوية التي يسكنون بها بكاليفورنيا، ويسعى كلاهما لاكتشاف حقيقة ما يحدث',
    "title": "Nope ",
    "year": '2021',
    "rate": '6.8/10',
    'img': mh1,
  },
  {
    "hight": .16,
    'discrip':
        'في إطار من الرعب والدراما، يجد جون فيني نفسه مختطفًا من شخص غامض في قبو مظلم بعيد في حي يشتهر قتل الأطفال وخطفهم به، وسرعان ما يجد نفسه يتواصل مع شخص غامض',
    "title": "The black phone ",
    "year": '2021',
    "rate": '6.8/10',
    'img': mh2,
  },
];
List sHorror = [
  {
    "hight": .16,
    'discrip':
        'عيش عائلة (دوتون) كأكبر عائلة في الولايات المتحدة تدير أراضي زراعية، ولكنهما دائمًا يتعرضون لمضايقات من تجار الأراضي، حيث يتعين على العائلة التصدي لتعدي جديد على أرضهم',
    "title": "YELLOWSTONE",
    "year": '2022',
    "rate": '18+',
    'img': sh1,
  },
  {
    "hight": .24,
    'discrip':
        'تدور فكرة البرنامج حول المنافسة بين عائلتين مؤلفة كل واحدة منهما من خمسة أفراد، تتواجهان وتتحديان بعضهما من خلال الإجابة عن أسئلة لها علاقة بالحياة اليومية، الاجتماعية، العملية والعائلية. الإجابات فهي نتيجة إستطلاعات للرأي تم إعدادها خصيصا لهذا البرنامج حيث طرحت على مئة شخص من عامة الناس من قبل فريق مختص.',
    "title": "Celebrity Family Feud",
    "year": '2021',
    "rate": 'PG',
    'img': sh2,
  },
];
List mPinoy = [
  {
    "hight": .16,
    'discrip': 'يذهب عميل سري في مهمة خطيرة لإسقاط عصابة جريمة. يواجه `` أبولو '
        ' وحلفاؤه ، مدفوعين بالماضي المرير والمؤلم ، مهمة شاقة ستتحدى عزيمته وقوته.',
    "title": "The Iron Heart",
    "year": '2022',
    "rate": '7.5/10',
    'img': mp1,
  },
  {
    "hight": .14,
    'discrip':
        'ملخص ميكانيكي السيارات إيلوي يترك انطباعا أوليا رهيبا على علي، الذي يعمل لدى قطب عقاري. لكن كلاهما يخفي شخصيتهما الحقيقية.',
    "title": "2 Good 2 Be True",
    "year": '2021',
    "rate": '7.2/10',
    'img': mp2,
  },
];
List sPinoy = [
  {
    "hight": .2,
    'discrip':
        'ويدور مسلسل Transplant الطبي حول الدكتور بشير حامد (حق) طبيب سوري يتمتع بشخصية كاريزمية ولديه مهارات مختبرة في طب الطوارئ، الذى يهرب هو وشقيقته الصغرى أميرة (جولامجوس) من وطنهم الذي مزقته الحرب ويصبحوا لاجئين، ويكافحون من أجل إقامة حياة جديدة في كندا،',
    "title": "Transplant",
    "year": '2022',
    "rate": 'PG15',
    'img': sp1,
  },
  {
    "hight": .24,
    'discrip':
        'مسلسل أمريكي ,  المسلسل يحكي قصة سبارتاكوس الذي أُسر بعد تمرده على الرومان في قتالهم ضد البرابرة، ويخوض قتالات الموت فأعجب به أحد السادة الرومان فشتراه وأخده ليتدرب في بيته الدي شيد لتدريب المقاتلين. تجري أحداث عديدة حتى أصبح من ألمع المصارعين الرومان، وفي نهاية القصة يتمرد سبارتاكوس على سيدة هو والعبيد مثله، فيقتل السيد ويخرج من المنزل لمواجهة الرومان..',
    "title": "Spartacus",
    "year": '2013',
    "rate": '18+',
    'img': sp2,
  },
];
List mTrukish = [
  {
    "hight": .16,
    'discrip': 'يذهب عميل سري في مهمة خطيرة لإسقاط عصابة جريمة. يواجه `` أبولو '
        ' وحلفاؤه ، مدفوعين بالماضي المرير والمؤلم ، مهمة شاقة ستتحدى عزيمته وقوته.',
    "title": "The Iron Heart",
    "year": '2021',
    "rate": '7.2/10',
    'img': mp1,
  },
  {
    "hight": .14,
    'discrip':
        'ملخص ميكانيكي السيارات إيلوي يترك انطباعا أوليا رهيبا على علي، الذي يعمل لدى قطب عقاري. لكن كلاهما يخفي شخصيتهما الحقيقية.',
    "title": "2 Good 2 Be True",
    "year": '2021',
    "rate": '7.2/10',
    'img': mp2,
  },
];
List sTrukish = [
  {
    "hight": .2,
    'discrip':
        'تبدأ أحداث المسلسل في عام ١٩٢٠م مع بداية إصدار القانون التاريخي بمنع بيع وتعاطي الكحول في الولايات الأمريكية المتحدة، في مدينة أتلانتيك سيتي تحديداً، بمشهد متهكم جبار. أدى هذا القانون لصعود رجال العصابات وجعلهم ملوك في عصرهم، وتصبح أمريكا ساحة معركة لأشهر رجال العصابات، آل كابون وغيره.',
    "title": "Boardwalk Empire",
    "year": '2018',
    "rate": '18+',
    'img': st1,
  },
  {
    "hight": .22,
    'discrip':
        'تعيش الدكتورة آسيا (جانسو دره) حياة هادئة وسعيدة مع زوجها فولكان (جانير جيندوروك) وابنهما علي (ألب أكار) يتغير هذا الوضع عندما تكتشف أن زوجها على علاقة بشابة منذ سنتين. على آسيا أن تختار بين إنقاذ زواجها أو الانتقام من زوجها الخائن.',
    "title": "Al Kha'en",
    "year": '2021',
    "rate": 'PG15',
    'img': st2,
  },
];

List<Tab> tabs = <Tab>[
  const Tab(text: "Movies"),
  const Tab(text: "Series"),
];

List notification = [
  {
    'img': mn1,
    'heder': 'سيتم عرض فيلم Mrs. Harris Goes to Paris',
    'meddle':'على قناه  OSN Movies premiere',
    'time':'Timing: 6/9/2023',
  },
  {
    'img': mn2,
    'heder': ' سيتم عرض فيلم  dune',
    'meddle':'على قناه  OSN Movies premiere',
    'time':'Timing: 6/23/2023',
  },
];
